chensy5525/MOCE_SDK_ESP32WROOM/components_esp32wroom/ch32_i2c_multi_gateway_final/ch32_i2c_multi_gateway_final.c
#include "ch32_i2c_multi_gateway_final.h"
#include "ch32_can_gateway_core.h"

#include "esp_err.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include <string.h>

static const char *TAG = "ch32_i2c_multi";

#define DYN_CMD_REQUEST_ID     0xF0U
#define DYN_CMD_ASSIGN_ID      0xF1U
#define DYN_CMD_ID_ACK         0xF2U
#define DYN_MAGIC_AA           0xAAU
#define DYN_MAGIC_55           0x55U
#define NODE_PROTOCOL_VERSION_V1 0x01U
#define NODE_PROTOCOL_VERSION_V2 0x02U
#define NODE_V2_MIN_FW_VERSION   4U

#define CAN_ID_DISCOVERY       0x000U
#define CAN_ID_STATUS_BASE     0x100U
#define CAN_ID_CMD_BASE        0x200U
#define CAN_ID_UART_RX_BASE    0x400U
#define CAN_ID_ACK_BASE        0x500U
#define CAN_ID_HELLO_BASE      0x700U

#define I2C_DEVICE_TYPE        CH32_I2C_MULTI_DYN_DEVICE_TYPE_I2C
#define UART_DEVICE_TYPE       0x04U
#define I2C_NODE_ID_MIN        0x01U
#define I2C_NODE_ID_MAX        0x20U

#define I2C_CMD_SCAN           0x01U
#define I2C_CMD_PROBE          0x02U
#define I2C_CMD_WRITE_REG      0x03U
#define I2C_CMD_READ_REGS      0x04U
#define I2C_CMD_WRITE_RAW      0x05U
#define I2C_CMD_WRITE_READ     0x06U
#define I2C_CMD_SET_SPEED      0x07U
#define I2C_CMD_WRITE_MULTI    0x08U

#define I2C_STATUS_SCAN        0x01U
#define I2C_STATUS_PROBE       0x02U
#define I2C_STATUS_WRITE       0x03U
#define I2C_STATUS_READ_CHUNK  0x05U
#define I2C_STATUS_READ_DONE   0x06U
#define I2C_STATUS_RAW_WRITE   0x07U
#define I2C_STATUS_SPEED       0x08U
#define I2C_STATUS_WRITE_MULTI 0x09U

#define I2C_MULTI_FLAG_START   0x01U
#define I2C_MULTI_FLAG_END     0x02U
#define I2C_MULTI_CHUNK_MAX    4U
#define I2C_MULTI_BUFFER_MAX   136U
#define I2C_MULTI_PER_CHUNK_ACK_MIN_FW 5U
#define I2C_MULTI_LEGACY_PACING_MS     2U
#define DISCOVERY_QUERY_INTERVAL_MS 100U
#define DISCOVERY_QUIET_MS          120U
#define DISCOVERY_MIN_ROUNDS        3U

static bool s_initialized;
static ch32_i2c_multi_config_t s_cfg;
static uint8_t s_request_ids[I2C_NODE_ID_MAX - I2C_NODE_ID_MIN + 1U];

static uint32_t ch32_i2c_multi_now_ms(void)
{
    return (uint32_t)(esp_timer_get_time() / 1000LL);
}

static uint32_t ch32_i2c_multi_remaining_ms(uint32_t deadline)
{
    uint32_t now = ch32_i2c_multi_now_ms();
    return (int32_t)(deadline - now) > 0 ? deadline - now : 0U;
}

void ch32_i2c_multi_default_config(ch32_i2c_multi_config_t *cfg)
{
    if (cfg == NULL) {
        return;
    }
    memset(cfg, 0, sizeof(*cfg));
    cfg->discovery_timeout_ms = 5000U;
    cfg->command_timeout_ms = 350U;
    cfg->discovery_query_interval_ms = DISCOVERY_QUERY_INTERVAL_MS;
    cfg->discovery_quiet_ms = DISCOVERY_QUIET_MS;
    cfg->discovery_min_rounds = DISCOVERY_MIN_ROUNDS;
}


int ch32_i2c_multi_init(const ch32_i2c_multi_config_t *cfg)
{
    if (cfg == NULL || cfg->command_timeout_ms == 0U ||
        cfg->discovery_timeout_ms == 0U ||
        cfg->discovery_query_interval_ms == 0U ||
        cfg->discovery_quiet_ms == 0U ||
        cfg->discovery_min_rounds == 0U) {
        return -1;
    }
    if (s_initialized) {
        return memcmp(&s_cfg, cfg, sizeof(s_cfg)) == 0 ? 0 : -1;
    }
    if (ch32_can_gateway_core_init() != 0) {
        ESP_LOGE(TAG, "shared CAN core init failed");
        return -1;
    }
    s_cfg = *cfg;
    s_initialized = true;
    ESP_LOGI(TAG, "protocol init OK");
    return 0;
}


static ch32_i2c_multi_result_t ch32_i2c_multi_map_core_result(
    ch32_can_gateway_result_t result)
{
    switch (result) {
    case CH32_CAN_GATEWAY_OK: return CH32_I2C_MULTI_RESULT_OK;
    case CH32_CAN_GATEWAY_TIMEOUT: return CH32_I2C_MULTI_RESULT_TIMEOUT;
    case CH32_CAN_GATEWAY_NO_DATA: return CH32_I2C_MULTI_RESULT_NO_DATA;
    case CH32_CAN_GATEWAY_INVALID_ARG:
        return CH32_I2C_MULTI_RESULT_INVALID_ARG;
    case CH32_CAN_GATEWAY_BUSY: return CH32_I2C_MULTI_RESULT_BUSY;
    case CH32_CAN_GATEWAY_OVERFLOW:
        return CH32_I2C_MULTI_RESULT_OVERFLOW;
    case CH32_CAN_GATEWAY_COMM_FAIL:
    default: return CH32_I2C_MULTI_RESULT_COMM_FAIL;
    }
}

static ch32_i2c_multi_result_t ch32_i2c_multi_send_until(
    uint32_t id, const uint8_t *data, uint8_t dlc, uint32_t deadline)
{
    uint32_t remaining = ch32_i2c_multi_remaining_ms(deadline);
    if (remaining == 0U) {
        return CH32_I2C_MULTI_RESULT_TIMEOUT;
    }
    return ch32_i2c_multi_map_core_result(
        ch32_can_gateway_core_send_timeout(id, data, dlc, remaining));
}

ch32_i2c_multi_result_t ch32_can_gateway_send_frame(
    uint32_t id, const uint8_t *data, uint8_t dlc)
{
    return ch32_i2c_multi_map_core_result(
        ch32_can_gateway_core_send(id, data, dlc));
}

void ch32_can_gateway_set_observer_filter(uint32_t filter_id)
{
    (void)filter_id;
}

#if CH32_CAN_GATEWAY_LEGACY_COMPAT
ch32_i2c_multi_result_t ch32_can_gateway_poll_control_frame(
    uint8_t device_type, ch32_i2c_multi_can_frame_t *frame,
    uint32_t timeout_ms)
{
    return ch32_i2c_multi_map_core_result(
        ch32_can_gateway_core_poll_control(
            device_type, (ch32_can_gateway_frame_t *)frame, timeout_ms));
}
#endif

ch32_i2c_multi_result_t ch32_can_gateway_poll_observed_frame(
    ch32_i2c_multi_can_frame_t *frame, uint32_t timeout_ms)
{
    return ch32_i2c_multi_map_core_result(
        ch32_can_gateway_core_poll_observer(
            I2C_DEVICE_TYPE, (ch32_can_gateway_frame_t *)frame,
            timeout_ms));
}

ch32_i2c_multi_result_t ch32_i2c_multi_poll_can_frame(
    ch32_i2c_multi_can_frame_t *frame, uint32_t timeout_ms)
{
    return ch32_i2c_multi_map_core_result(
        ch32_can_gateway_core_poll_data(
            (ch32_can_gateway_frame_t *)frame, timeout_ms));
}

static void ch32_i2c_multi_drain_observer_queue(uint32_t settle_ms)
{
    ch32_i2c_multi_can_frame_t discarded;
    uint32_t deadline = ch32_i2c_multi_now_ms() + settle_ms;
    ch32_i2c_multi_result_t result;

    do {
        uint32_t wait_ms = settle_ms == 0U ? 0U : 10U;
        result = ch32_can_gateway_poll_observed_frame(&discarded, wait_ms);
    } while (settle_ms == 0U
                 ? result == CH32_I2C_MULTI_RESULT_OK
                 : (int32_t)(deadline - ch32_i2c_multi_now_ms()) > 0);
}

