chensy5525/MOCE_SDK_ESP32WROOM/components_esp32wroom/ch32_i2c_multi_gateway_final/ch32_i2c_multi_gateway_final.c
static ch32_i2c_multi_node_t *ch32_i2c_multi_find_token(
    ch32_i2c_multi_node_t *nodes, size_t count, uint16_t token)
{
    for (size_t index = 0U; index < count; ++index) {
        if (nodes[index].device_type == I2C_DEVICE_TYPE &&
            nodes[index].token == token) {
            return &nodes[index];
        }
    }
    return NULL;
}

static bool ch32_i2c_multi_id_used(const ch32_i2c_multi_node_t *nodes,
                                   size_t count, uint8_t node_id,
                                   const ch32_i2c_multi_node_t *except)
{
    for (size_t index = 0U; index < count; ++index) {
        if (&nodes[index] != except && nodes[index].node_id == node_id) {
            return true;
        }
    }
    return false;
}

static uint8_t ch32_i2c_multi_allocate_id(
    const ch32_i2c_multi_node_t *nodes, size_t count,
    const ch32_i2c_multi_node_t *except)
{
    for (uint8_t candidate = I2C_NODE_ID_MIN;
         candidate <= I2C_NODE_ID_MAX; ++candidate) {
        if (!ch32_i2c_multi_id_used(nodes, count, candidate, except)) {
            return candidate;
        }
    }
    return 0U;
}

static ch32_i2c_multi_result_t ch32_i2c_multi_send_assignment(
    ch32_i2c_multi_node_t *node, uint8_t node_id)
{
    uint8_t assignment[8] = {
        DYN_CMD_ASSIGN_ID, node_id, DYN_MAGIC_AA, DYN_MAGIC_55,
        (uint8_t)node->token, (uint8_t)(node->token >> 8U),
        I2C_DEVICE_TYPE, node->protocol_version
    };

    node->node_id = node_id;
    node->ready = false;
    return ch32_can_gateway_send_frame(CAN_ID_DISCOVERY, assignment,
                                       sizeof(assignment));
}

#if CH32_CAN_GATEWAY_LEGACY_COMPAT
ch32_i2c_multi_result_t ch32_i2c_multi_discover_and_assign(
    ch32_i2c_multi_node_t *nodes, uint8_t max_nodes, size_t *count,
    uint32_t timeout_ms)
{
    return ch32_i2c_multi_discover_incremental(nodes, max_nodes, count,
                                               timeout_ms);
}
#endif

ch32_i2c_multi_result_t ch32_i2c_multi_discover_incremental(
    ch32_i2c_multi_node_t *nodes, uint8_t max_nodes, size_t *count,
    uint32_t timeout_ms)
{
    static uint8_t query_sequence;
    uint8_t query[8] = {
        DYN_CMD_REQUEST_ID, I2C_DEVICE_TYPE, NODE_PROTOCOL_VERSION_V2, 0U,
        0U, 0U, 0U, 0U
    };
    uint32_t deadline;
    uint32_t next_query_ms;
    bool confirmed = false;
    bool transmit_failed = false;
    uint8_t queries_sent = 1U;
    uint32_t last_activity_ms;

    if (!s_initialized || nodes == NULL || count == NULL ||
        max_nodes == 0U || *count > max_nodes) {
        return CH32_I2C_MULTI_RESULT_INVALID_ARG;
    }
    ch32_i2c_multi_drain_observer_queue(0U);
    query[4] = ++query_sequence;
    if (ch32_can_gateway_send_frame(CAN_ID_DISCOVERY, query, sizeof(query)) !=
        CH32_I2C_MULTI_RESULT_OK) {
        transmit_failed = true;
        ESP_LOGW(TAG, "initial F0 transmit deferred seq=%u", query[4]);
    }

    deadline = ch32_i2c_multi_now_ms() + timeout_ms;
    last_activity_ms = ch32_i2c_multi_now_ms();
    next_query_ms = last_activity_ms + s_cfg.discovery_query_interval_ms;
    while ((int32_t)(deadline - ch32_i2c_multi_now_ms()) > 0) {
        ch32_i2c_multi_can_frame_t frame;
        ch32_i2c_multi_node_t *node;
        uint16_t token;
        uint32_t now_ms = ch32_i2c_multi_now_ms();
        bool assignment_pending = false;

        for (size_t index = 0U; index < *count; ++index) {
            if (nodes[index].token != 0U && !nodes[index].ready) {
                assignment_pending = true;
                break;
            }
        }
        if (confirmed && !assignment_pending &&
            queries_sent >= s_cfg.discovery_min_rounds &&
            (uint32_t)(now_ms - last_activity_ms) >=
                s_cfg.discovery_quiet_ms) {
            break;
        }

        /* 不同查询序号会改变 CH32 的 token 退避槽。即使两个节点本轮
         * 的 0x000 回包碰撞，下一轮也能获得新的发送时机。 */
        if ((int32_t)(now_ms - next_query_ms) >= 0 &&
            (assignment_pending || !confirmed ||
             queries_sent < s_cfg.discovery_min_rounds)) {
            query[4] = ++query_sequence;
            if (ch32_can_gateway_send_frame(CAN_ID_DISCOVERY, query,
                                            sizeof(query)) !=
                CH32_I2C_MULTI_RESULT_OK) {
                transmit_failed = true;
                ESP_LOGW(TAG, "F0 retry deferred seq=%u", query[4]);
            }
            queries_sent++;
            next_query_ms = now_ms + s_cfg.discovery_query_interval_ms;
        }

        if (ch32_can_gateway_poll_observed_frame(&frame, 50U) !=
            CH32_I2C_MULTI_RESULT_OK) {
            continue;
        }
        if (frame.id >= CAN_ID_HELLO_BASE &&
            frame.id < CAN_ID_HELLO_BASE + 256U && frame.dlc >= 4U &&
            frame.data[0] == I2C_DEVICE_TYPE) {
            uint8_t hello_node_id = (uint8_t)(frame.id - CAN_ID_HELLO_BASE);
            for (size_t index = 0U; index < *count; ++index) {
                if (nodes[index].ready && nodes[index].node_id == hello_node_id) {
                    nodes[index].fw_version = frame.data[2];
                    nodes[index].capability_flags = frame.data[3];
                    break;
                }
            }
            continue;
        }
        if (frame.dlc != 8U) {
            continue;
        }

        if (frame.id == CAN_ID_DISCOVERY &&
            frame.data[0] == DYN_CMD_ID_ACK &&
            frame.data[2] == DYN_MAGIC_AA &&
            frame.data[3] == DYN_MAGIC_55 &&
            frame.data[6] == I2C_DEVICE_TYPE &&
            frame.data[1] >= I2C_NODE_ID_MIN &&
            frame.data[1] <= I2C_NODE_ID_MAX) {
            uint8_t acknowledged_id = frame.data[1];
            token = (uint16_t)frame.data[4] |
                    ((uint16_t)frame.data[5] << 8U);
            if (token == 0U) {
                continue;
            }
            node = ch32_i2c_multi_find_token(nodes, *count, token);
            if (node == NULL) {
                bool collision = ch32_i2c_multi_id_used(
                    nodes, *count, acknowledged_id, NULL);
                if (*count >= max_nodes) {
                    continue;
                }
                node = &nodes[(*count)++];
                memset(node, 0, sizeof(*node));
                node->token = token;
                node->device_type = I2C_DEVICE_TYPE;
                if (collision) {
                    uint8_t replacement = ch32_i2c_multi_allocate_id(
                        nodes, *count, node);
                    if (replacement != 0U) {
                        (void)ch32_i2c_multi_send_assignment(node,
                                                             replacement);
                    }
                    continue;
                }
            } else if (ch32_i2c_multi_id_used(nodes, *count,
                                              acknowledged_id, node)) {
                uint8_t replacement = ch32_i2c_multi_allocate_id(
                    nodes, *count, node);
                if (replacement != 0U) {
                    (void)ch32_i2c_multi_send_assignment(node, replacement);
                }
                continue;
            }
            {
                bool first_confirmation = !node->ready;
                node->node_id = acknowledged_id;
                node->fw_version = frame.data[7];
                if (node->protocol_version == 0U) {
                    node->protocol_version =
                        node->fw_version >= NODE_V2_MIN_FW_VERSION
                            ? NODE_PROTOCOL_VERSION_V2
                            : NODE_PROTOCOL_VERSION_V1;
                }
                node->ready = true;
                confirmed = true;
                if (first_confirmation) {
                    last_activity_ms = ch32_i2c_multi_now_ms();
                    ESP_LOGI(TAG,
                             "F2 confirmed type=0x%02X token=0x%04X node=%u fw=%u",
                             I2C_DEVICE_TYPE, token, acknowledged_id,
                             node->fw_version);
                }
            }
            continue;
        }

        if (frame.id != CAN_ID_DISCOVERY ||
            frame.data[0] != DYN_CMD_REQUEST_ID ||
            frame.data[1] != I2C_DEVICE_TYPE) {
            continue;
        }
        token = (uint16_t)frame.data[5] |
                ((uint16_t)frame.data[6] << 8U);
        if (token == 0U) {
            continue;
        }
        node = ch32_i2c_multi_find_token(nodes, *count, token);
        if (node == NULL) {
            if (*count >= max_nodes) {
                continue;
            }
            node = &nodes[(*count)++];
            memset(node, 0, sizeof(*node));
            node->token = token;
            node->device_type = I2C_DEVICE_TYPE;
            node->protocol_version =
                frame.data[2] >= NODE_V2_MIN_FW_VERSION
                    ? NODE_PROTOCOL_VERSION_V2 : NODE_PROTOCOL_VERSION_V1;
            last_activity_ms = ch32_i2c_multi_now_ms();
            ESP_LOGI(TAG,
                     "F0 discovered type=0x%02X token=0x%04X fw=%u caps=0x%02X",
                     I2C_DEVICE_TYPE, token, frame.data[2], frame.data[3]);
        }
        node->fw_version = frame.data[2];
        node->capability_flags = frame.data[3];
        {
            uint8_t assigned_id = node->node_id;
            if (node->ready) {
                ch32_can_gateway_core_session_invalidate(
                    I2C_DEVICE_TYPE, node->node_id);
                node->ready = false;
                node->speed_valid = false;
                last_activity_ms = ch32_i2c_multi_now_ms();
                ESP_LOGW(TAG,
                         "F0 restart detected token=0x%04X old_node=%u",
                         token, assigned_id);
            }
            if (assigned_id < I2C_NODE_ID_MIN ||
                assigned_id > I2C_NODE_ID_MAX ||
                ch32_i2c_multi_id_used(nodes, *count, assigned_id, node)) {
                assigned_id = ch32_i2c_multi_allocate_id(
                    nodes, *count, node);
            }
            if (assigned_id != 0U &&
                ch32_i2c_multi_send_assignment(node, assigned_id) !=
                    CH32_I2C_MULTI_RESULT_OK) {
                transmit_failed = true;
                continue;
            }
            if (assigned_id != 0U) {
                last_activity_ms = ch32_i2c_multi_now_ms();
                ESP_LOGI(TAG,
                         "F1 sent type=0x%02X token=0x%04X node=%u",
                         I2C_DEVICE_TYPE, token, assigned_id);
            }
        }
    }
    ch32_i2c_multi_drain_observer_queue(0U);
    if (confirmed) {
        return CH32_I2C_MULTI_RESULT_OK;
    }
    return transmit_failed ? CH32_I2C_MULTI_RESULT_COMM_FAIL
                           : CH32_I2C_MULTI_RESULT_TIMEOUT;
}

static bool ch32_i2c_multi_node_valid(const ch32_i2c_multi_node_t *node)
{
    return node != NULL && node->ready && node->token != 0U &&
           node->node_id >= I2C_NODE_ID_MIN &&
           node->node_id <= I2C_NODE_ID_MAX;
}

static ch32_i2c_multi_result_t ch32_i2c_multi_session_acquire(
    const ch32_i2c_multi_node_t *node, uint32_t deadline)
{
    uint32_t remaining = ch32_i2c_multi_remaining_ms(deadline);
    if (remaining == 0U) {
        return CH32_I2C_MULTI_RESULT_TIMEOUT;
    }
    return ch32_i2c_multi_map_core_result(
        ch32_can_gateway_core_session_acquire(
            I2C_DEVICE_TYPE, node->node_id, remaining));
}

