chensy5525/MOCE_SDK_ESP32WROOM/components_esp32wroom/ch32_i2c_multi_gateway_final/ch32_i2c_multi_gateway_final.c
static ch32_i2c_multi_result_t ch32_i2c_multi_session_poll(
    const ch32_i2c_multi_node_t *node, ch32_i2c_multi_can_frame_t *frame,
    uint32_t deadline)
{
    uint32_t remaining = ch32_i2c_multi_remaining_ms(deadline);
    uint32_t wait_ms;

    if (remaining == 0U) {
        return CH32_I2C_MULTI_RESULT_TIMEOUT;
    }
    wait_ms = remaining < 20U ? remaining : 20U;
    return ch32_i2c_multi_map_core_result(
        ch32_can_gateway_core_session_poll(
            I2C_DEVICE_TYPE, node->node_id,
            (ch32_can_gateway_frame_t *)frame, wait_ms));
}

static void ch32_i2c_multi_session_release(
    const ch32_i2c_multi_node_t *node)
{
    ch32_can_gateway_core_session_release(I2C_DEVICE_TYPE, node->node_id);
}

static ch32_i2c_multi_result_t ch32_i2c_multi_wait_command(
    const ch32_i2c_multi_node_t *node, uint8_t command_type,
    uint8_t status_type, uint8_t expected_addr, uint8_t expected_detail,
    ch32_i2c_multi_can_frame_t *status_frame, uint32_t deadline)
{
    bool status_received = false;
    bool status_success = false;
    bool ack_received = false;
    bool ack_success = false;

    while ((int32_t)(deadline - ch32_i2c_multi_now_ms()) > 0) {
        ch32_i2c_multi_can_frame_t frame;
        ch32_i2c_multi_result_t poll_result =
            ch32_i2c_multi_session_poll(node, &frame, deadline);
        if (poll_result != CH32_I2C_MULTI_RESULT_OK) {
            if (poll_result == CH32_I2C_MULTI_RESULT_OVERFLOW) {
                return poll_result;
            }
            continue;
        }
        if (frame.id == CAN_ID_STATUS_BASE + node->node_id &&
            frame.dlc == 8U && frame.data[0] == status_type) {
            bool matches = true;
            if (status_type != I2C_STATUS_SCAN &&
                status_type != I2C_STATUS_SPEED) {
                matches = frame.data[1] == expected_addr;
            }
            if (status_type == I2C_STATUS_WRITE_MULTI) {
                matches = matches && frame.data[2] == expected_detail;
            } else if (status_type == I2C_STATUS_SPEED) {
                matches = frame.data[1] == expected_detail;
            }
            if (!matches) {
                continue;
            }
            status_received = true;
            if (status_type == I2C_STATUS_PROBE ||
                status_type == I2C_STATUS_SPEED) {
                status_success = frame.data[2] != 0U;
            } else if (status_type == I2C_STATUS_WRITE ||
                       status_type == I2C_STATUS_RAW_WRITE ||
                       status_type == I2C_STATUS_WRITE_MULTI) {
                status_success = frame.data[4] != 0U;
            } else {
                status_success = true;
            }
            if (status_frame != NULL) {
                *status_frame = frame;
            }
        } else if (frame.id == CAN_ID_ACK_BASE + node->node_id &&
                   frame.dlc == 8U && frame.data[0] == command_type &&
                   frame.data[2] == node->node_id &&
                   frame.data[3] == I2C_DEVICE_TYPE) {
            ack_received = true;
            ack_success = frame.data[1] != 0U;
        }
        if (status_received && ack_received) {
            if (!ack_success) {
                return CH32_I2C_MULTI_RESULT_COMM_FAIL;
            }
            /* A completed probe is a valid transaction even when the
             * downstream address did not ACK.  The found/not-found result is
             * carried in the status payload and must not be collapsed into a
             * transport failure. */
            if (status_type == I2C_STATUS_PROBE) {
                return CH32_I2C_MULTI_RESULT_OK;
            }
            return status_success ? CH32_I2C_MULTI_RESULT_OK
                                  : CH32_I2C_MULTI_RESULT_COMM_FAIL;
        }
    }
    return CH32_I2C_MULTI_RESULT_TIMEOUT;
}

static ch32_i2c_multi_result_t ch32_i2c_multi_run_command_timeout(
    const ch32_i2c_multi_node_t *node, const uint8_t command[8],
    uint8_t status_type, uint8_t expected_addr, uint8_t expected_detail,
    ch32_i2c_multi_can_frame_t *status_frame, uint32_t timeout_ms)
{
    ch32_i2c_multi_result_t result;
    uint32_t deadline;

    if (!ch32_i2c_multi_node_valid(node)) {
        return CH32_I2C_MULTI_RESULT_INVALID_ARG;
    }
    if (timeout_ms == 0U) {
        return CH32_I2C_MULTI_RESULT_INVALID_ARG;
    }
    deadline = ch32_i2c_multi_now_ms() + timeout_ms;
    result = ch32_i2c_multi_session_acquire(node, deadline);
    if (result != CH32_I2C_MULTI_RESULT_OK) {
        return result;
    }
    ch32_can_gateway_core_session_drain(I2C_DEVICE_TYPE, node->node_id);
    result = ch32_i2c_multi_send_until(CAN_ID_CMD_BASE + node->node_id,
                                       command, 8U, deadline);
    if (result == CH32_I2C_MULTI_RESULT_OK) {
        result = ch32_i2c_multi_wait_command(
            node, command[0], status_type, expected_addr, expected_detail,
            status_frame, deadline);
    }
    ch32_i2c_multi_session_release(node);
    return result;
}

ch32_i2c_multi_result_t ch32_i2c_multi_scan(
    const ch32_i2c_multi_node_t *node, ch32_i2c_multi_scan_result_t *scan_result)
{
    const uint8_t command[8] = {I2C_CMD_SCAN, 0U, 0U, 0U,
                                0U, 0U, 0U, 0U};
    ch32_i2c_multi_can_frame_t status = {0};
    ch32_i2c_multi_result_t result;
    uint8_t reported;

    if (node == NULL || scan_result == NULL) {
        return CH32_I2C_MULTI_RESULT_INVALID_ARG;
    }
    memset(scan_result, 0, sizeof(*scan_result));
    result = ch32_i2c_multi_run_command_timeout(
        node, command, I2C_STATUS_SCAN, 0U, 0U, &status,
        s_cfg.command_timeout_ms);
    if (result != CH32_I2C_MULTI_RESULT_OK) {
        return result;
    }
    reported = status.data[1] > 6U ? 6U : status.data[1];
    for (uint8_t index = 0U; index < reported &&
         scan_result->i2c_addr_count < CH32_I2C_MULTI_MAX_ADDRS_PER_NODE;
         ++index) {
        scan_result->i2c_addrs[scan_result->i2c_addr_count++] =
            status.data[2U + index];
    }
    if (status.data[1] == 0U && status.data[2] == 0xD1U) {
        scan_result->bus_diag_valid = true;
        scan_result->scl_before_high = status.data[3] != 0U;
        scan_result->sda_before_high = status.data[4] != 0U;
        scan_result->recovery_ok = status.data[5] != 0U;
        scan_result->scl_after_high = (status.data[6] & 0x01U) != 0U;
        scan_result->sda_after_high = (status.data[6] & 0x02U) != 0U;
        scan_result->gpio_ack_normal = (status.data[6] & 0x04U) != 0U;
        scan_result->gpio_ack_swapped = (status.data[6] & 0x08U) != 0U;
        ESP_LOGI(TAG,
                 "GPIO probe token=0x%04X node=%u addr=0x29 normal=%u swapped=%u",
                 node->token, node->node_id, scan_result->gpio_ack_normal,
                 scan_result->gpio_ack_swapped);
    }
    return CH32_I2C_MULTI_RESULT_OK;
}

ch32_i2c_multi_result_t ch32_i2c_multi_probe(
    const ch32_i2c_multi_node_t *node, uint8_t addr, bool *found)
{
    return ch32_i2c_multi_probe_timeout(node, addr, found,
                                        s_cfg.command_timeout_ms);
}

ch32_i2c_multi_result_t ch32_i2c_multi_probe_timeout(
    const ch32_i2c_multi_node_t *node, uint8_t addr, bool *found,
    uint32_t timeout_ms)
{
    uint8_t command[8] = {I2C_CMD_PROBE, addr, 0U, 0U,
                          0U, 0U, 0U, 0U};
    ch32_i2c_multi_can_frame_t status = {0};
    ch32_i2c_multi_result_t result;

    if (found == NULL || addr > 0x7FU) {
        return CH32_I2C_MULTI_RESULT_INVALID_ARG;
    }
    *found = false;
    result = ch32_i2c_multi_run_command_timeout(
        node, command, I2C_STATUS_PROBE, addr, 0U, &status, timeout_ms);
    if (result == CH32_I2C_MULTI_RESULT_OK) {
        *found = status.data[2] != 0U;
    }
    return result;
}

