chensy5525/MOCE_SDK_ESP32WROOM/components_esp32wroom/ch32_i2c_multi_gateway_final/ch32_i2c_multi_gateway_final.c
ch32_i2c_multi_result_t ch32_i2c_multi_write_reg_to(
    const ch32_i2c_multi_node_t *node, uint8_t addr, uint8_t reg,
    const uint8_t *data, uint8_t len)
{
    return ch32_i2c_multi_write_reg_to_timeout(
        node, addr, reg, data, len, s_cfg.command_timeout_ms);
}

ch32_i2c_multi_result_t ch32_i2c_multi_write_reg_to_timeout(
    const ch32_i2c_multi_node_t *node, uint8_t addr, uint8_t reg,
    const uint8_t *data, uint8_t len, uint32_t timeout_ms)
{
    uint8_t command[8] = {I2C_CMD_WRITE_REG, addr, reg, len,
                          0U, 0U, 0U, 0U};

    if (addr > 0x7FU || len > 4U || (len > 0U && data == NULL)) {
        return CH32_I2C_MULTI_RESULT_INVALID_ARG;
    }
    if (len > 0U) {
        memcpy(&command[4], data, len);
    }
    return ch32_i2c_multi_run_command_timeout(
        node, command, I2C_STATUS_WRITE, addr, 0U, NULL, timeout_ms);
}

ch32_i2c_multi_result_t ch32_i2c_multi_write_to(
    const ch32_i2c_multi_node_t *node, uint8_t addr,
    const uint8_t *data, uint8_t len)
{
    uint8_t command[8] = {I2C_CMD_WRITE_RAW, addr, len, 0U,
                          0U, 0U, 0U, 0U};

    if (addr > 0x7FU || data == NULL || len == 0U || len > 5U) {
        return CH32_I2C_MULTI_RESULT_INVALID_ARG;
    }
    memcpy(&command[3], data, len);
    return ch32_i2c_multi_run_command_timeout(
        node, command, I2C_STATUS_RAW_WRITE, addr, 0U, NULL,
        s_cfg.command_timeout_ms);
}

ch32_i2c_multi_result_t ch32_i2c_multi_write_multi_to(
    const ch32_i2c_multi_node_t *node, uint8_t addr,
    const uint8_t *data, uint8_t len)
{
    return ch32_i2c_multi_write_multi_to_timeout(
        node, addr, data, len, s_cfg.command_timeout_ms);
}

ch32_i2c_multi_result_t ch32_i2c_multi_write_multi_to_timeout(
    const ch32_i2c_multi_node_t *node, uint8_t addr,
    const uint8_t *data, uint8_t len, uint32_t timeout_ms)
{
    ch32_i2c_multi_result_t result = CH32_I2C_MULTI_RESULT_OK;
    uint8_t offset = 0U;
    uint32_t deadline;
    bool wait_each_chunk;

    if (!ch32_i2c_multi_node_valid(node) || addr > 0x7FU || data == NULL ||
        len == 0U || len > I2C_MULTI_BUFFER_MAX || timeout_ms == 0U) {
        return CH32_I2C_MULTI_RESULT_INVALID_ARG;
    }
    deadline = ch32_i2c_multi_now_ms() + timeout_ms;
    result = ch32_i2c_multi_session_acquire(node, deadline);
    if (result != CH32_I2C_MULTI_RESULT_OK) {
        return result;
    }
    ch32_can_gateway_core_session_drain(I2C_DEVICE_TYPE, node->node_id);
    /* FW v5 adds receiver-side flow control for protocol v2.  Older v2
     * firmware only acknowledges the final fragment, so retain compatibility
     * with a short pacing delay while avoiding an RX-FIFO burst. */
    wait_each_chunk = node->protocol_version < NODE_PROTOCOL_VERSION_V2 ||
                      node->fw_version >= I2C_MULTI_PER_CHUNK_ACK_MIN_FW;
    while (offset < len) {
        uint8_t chunk = (uint8_t)(len - offset);
        uint8_t flags = 0U;
        uint8_t command[8] = {I2C_CMD_WRITE_MULTI, addr, 0U, 0U,
                              0U, 0U, 0U, 0U};
        if (chunk > I2C_MULTI_CHUNK_MAX) {
            chunk = I2C_MULTI_CHUNK_MAX;
        }
        if (offset == 0U) {
            flags |= I2C_MULTI_FLAG_START;
        }
        if ((uint16_t)offset + chunk == len) {
            flags |= I2C_MULTI_FLAG_END;
        }
        command[2] = flags;
        command[3] = chunk;
        memcpy(&command[4], &data[offset], chunk);
        result = ch32_i2c_multi_send_until(
            CAN_ID_CMD_BASE + node->node_id, command, 8U, deadline);
        if (result == CH32_I2C_MULTI_RESULT_OK &&
            (wait_each_chunk || (flags & I2C_MULTI_FLAG_END) != 0U)) {
            result = ch32_i2c_multi_wait_command(
                node, I2C_CMD_WRITE_MULTI, I2C_STATUS_WRITE_MULTI,
                addr, flags, NULL, deadline);
        } else if (result == CH32_I2C_MULTI_RESULT_OK) {
            vTaskDelay(pdMS_TO_TICKS(I2C_MULTI_LEGACY_PACING_MS));
        }
        if (result != CH32_I2C_MULTI_RESULT_OK) {
            break;
        }
        offset = (uint8_t)(offset + chunk);
    }
    ch32_i2c_multi_session_release(node);
    return result;
}

#if CH32_CAN_GATEWAY_LEGACY_COMPAT
static uint8_t ch32_i2c_multi_primary_addr(const ch32_i2c_multi_node_t *node)
{
    return node != NULL && node->i2c_addr_count > 0U
               ? node->i2c_addrs[0]
               : 0xFFU;
}

ch32_i2c_multi_result_t ch32_i2c_multi_write_raw(
    const ch32_i2c_multi_node_t *node, const uint8_t *data, uint8_t len)
{
    return ch32_i2c_multi_write_to(node, ch32_i2c_multi_primary_addr(node),
                                   data, len);
}

ch32_i2c_multi_result_t ch32_i2c_multi_write_raw_once(
    const ch32_i2c_multi_node_t *node, const uint8_t *data, uint8_t len)
{
    return ch32_i2c_multi_write_raw(node, data, len);
}

ch32_i2c_multi_result_t ch32_i2c_multi_write_reg(
    const ch32_i2c_multi_node_t *node, uint8_t reg,
    const uint8_t *data, uint8_t len)
{
    return ch32_i2c_multi_write_reg_to(
        node, ch32_i2c_multi_primary_addr(node), reg, data, len);
}
#endif

ch32_i2c_multi_result_t ch32_i2c_multi_read_regs_from(
    const ch32_i2c_multi_node_t *node, uint8_t addr, uint8_t reg,
    uint8_t *data, uint8_t len)
{
    return ch32_i2c_multi_read_regs_from_timeout(
        node, addr, reg, data, len, s_cfg.command_timeout_ms);
}

ch32_i2c_multi_result_t ch32_i2c_multi_read_regs_from_timeout(
    const ch32_i2c_multi_node_t *node, uint8_t addr, uint8_t reg,
    uint8_t *data, uint8_t len, uint32_t timeout_ms)
{
    uint8_t request_id;
    uint8_t command[8] = {I2C_CMD_READ_REGS, addr, reg, len,
                          0U, 0U, 0U, 0U};
    uint32_t deadline;
    uint8_t received = 0U;
    bool done_received = false;
    bool done_success = false;
    bool ack_received = false;
    bool ack_success = false;
    ch32_i2c_multi_result_t result;

    if (!ch32_i2c_multi_node_valid(node) || addr > 0x7FU || data == NULL ||
        len == 0U || len > 32U || timeout_ms == 0U) {
        return CH32_I2C_MULTI_RESULT_INVALID_ARG;
    }
    deadline = ch32_i2c_multi_now_ms() + timeout_ms;
    result = ch32_i2c_multi_session_acquire(node, deadline);
    if (result != CH32_I2C_MULTI_RESULT_OK) {
        return result;
    }
    request_id = ++s_request_ids[node->node_id - I2C_NODE_ID_MIN];
    if (request_id == 0U) {
        request_id = ++s_request_ids[node->node_id - I2C_NODE_ID_MIN];
    }
    command[4] = request_id;
    ch32_can_gateway_core_session_drain(I2C_DEVICE_TYPE, node->node_id);
    result = ch32_i2c_multi_send_until(CAN_ID_CMD_BASE + node->node_id,
                                       command, 8U, deadline);
    if (result != CH32_I2C_MULTI_RESULT_OK) {
        goto read_done;
    }

