chensy5525/MOCE_SDK_ESP32WROOM/components_esp32wroom/ch32_i2c_multi_gateway_final/ch32_i2c_multi_gateway_final.c
    while ((int32_t)(deadline - ch32_i2c_multi_now_ms()) > 0) {
        ch32_i2c_multi_can_frame_t frame;
        ch32_i2c_multi_result_t poll_result =
            ch32_i2c_multi_session_poll(node, &frame, deadline);
        if (poll_result != CH32_I2C_MULTI_RESULT_OK) {
            if (poll_result == CH32_I2C_MULTI_RESULT_OVERFLOW) {
                result = poll_result;
                goto read_done;
            }
            continue;
        }
        if (frame.id == CAN_ID_STATUS_BASE + node->node_id &&
            frame.dlc == 8U && frame.data[0] == I2C_STATUS_READ_CHUNK &&
            frame.data[1] == request_id && frame.data[3] <= 4U &&
            (uint16_t)frame.data[2] + frame.data[3] <= len) {
            memcpy(&data[frame.data[2]], &frame.data[4], frame.data[3]);
            if ((uint8_t)(frame.data[2] + frame.data[3]) > received) {
                received = (uint8_t)(frame.data[2] + frame.data[3]);
            }
        } else if (frame.id == CAN_ID_STATUS_BASE + node->node_id &&
                   frame.dlc == 8U && frame.data[0] == I2C_STATUS_READ_DONE &&
                   frame.data[1] == request_id && frame.data[2] == addr &&
                   frame.data[3] == reg && frame.data[4] == len) {
            done_received = true;
            done_success = frame.data[5] != 0U && frame.data[6] == len;
        } else if (frame.id == CAN_ID_ACK_BASE + node->node_id &&
                   frame.dlc == 8U && frame.data[0] == I2C_CMD_READ_REGS &&
                   frame.data[2] == node->node_id &&
                   frame.data[3] == I2C_DEVICE_TYPE) {
            ack_received = true;
            ack_success = frame.data[1] != 0U;
        }
        if (done_received && ack_received) {
            result = done_success && ack_success && received == len
                         ? CH32_I2C_MULTI_RESULT_OK
                         : CH32_I2C_MULTI_RESULT_COMM_FAIL;
            goto read_done;
        }
    }
    result = CH32_I2C_MULTI_RESULT_TIMEOUT;

read_done:
    ch32_i2c_multi_session_release(node);
    return result;
}

#if CH32_CAN_GATEWAY_LEGACY_COMPAT
ch32_i2c_multi_result_t ch32_i2c_multi_read_regs(
    const ch32_i2c_multi_node_t *node, uint8_t reg, uint8_t *data, uint8_t len)
{
    return ch32_i2c_multi_read_regs_from(
        node, ch32_i2c_multi_primary_addr(node), reg, data, len);
}

ch32_i2c_multi_result_t ch32_i2c_multi_read_regs_once(
    const ch32_i2c_multi_node_t *node, uint8_t reg, uint8_t *data, uint8_t len)
{
    return ch32_i2c_multi_read_regs(node, reg, data, len);
}

ch32_i2c_multi_result_t ch32_i2c_multi_write_multi(
    const ch32_i2c_multi_node_t *node, const uint8_t *data, uint8_t len)
{
    return ch32_i2c_multi_write_multi_to(
        node, ch32_i2c_multi_primary_addr(node), data, len);
}

ch32_i2c_multi_result_t ch32_i2c_multi_write_multi_once(
    const ch32_i2c_multi_node_t *node, const uint8_t *data, uint8_t len)
{
    return ch32_i2c_multi_write_multi(node, data, len);
}

ch32_i2c_multi_result_t ch32_i2c_multi_write_read_reg(
    const ch32_i2c_multi_node_t *node, uint8_t reg,
    const uint8_t *wdata, uint8_t wlen, uint8_t *rdata, uint8_t rlen)
{
    if (wlen != 1U || wdata == NULL || wdata[0] != reg) {
        return CH32_I2C_MULTI_RESULT_INVALID_ARG;
    }
    return ch32_i2c_multi_read_regs_from(
        node, ch32_i2c_multi_primary_addr(node), reg, rdata, rlen);
}
#endif

ch32_i2c_multi_result_t ch32_i2c_multi_write_read_to_timeout(
    const ch32_i2c_multi_node_t *node, uint8_t addr,
    const uint8_t *write_data, uint8_t write_len,
    uint8_t *read_data, uint8_t read_len, uint32_t timeout_ms)
{
    uint8_t request_id;
    uint8_t command[8] = {I2C_CMD_WRITE_READ, addr, write_len, read_len,
                           0U, 0U, 0U, 0U};
    uint32_t deadline;
    uint8_t received = 0U;
    bool done_received = false, done_success = false;
    bool ack_received = false, ack_success = false;
    ch32_i2c_multi_result_t result;

    if (!ch32_i2c_multi_node_valid(node) || addr > 0x7FU ||
        write_data == NULL || write_len == 0U || write_len > 3U ||
        read_data == NULL || read_len == 0U || read_len > 32U ||
        timeout_ms == 0U) {
        return CH32_I2C_MULTI_RESULT_INVALID_ARG;
    }
    memcpy(&command[5], write_data, write_len);
    deadline = ch32_i2c_multi_now_ms() + timeout_ms;
    result = ch32_i2c_multi_session_acquire(node, deadline);
    if (result != CH32_I2C_MULTI_RESULT_OK) return result;
    request_id = ++s_request_ids[node->node_id - I2C_NODE_ID_MIN];
    if (request_id == 0U) {
        request_id = ++s_request_ids[node->node_id - I2C_NODE_ID_MIN];
    }
    command[4] = request_id;
    ch32_can_gateway_core_session_drain(I2C_DEVICE_TYPE, node->node_id);
    result = ch32_i2c_multi_send_until(CAN_ID_CMD_BASE + node->node_id,
                                       command, 8U, deadline);
    if (result != CH32_I2C_MULTI_RESULT_OK) {
        ch32_i2c_multi_session_release(node);
        return result;
    }
    while ((int32_t)(deadline - ch32_i2c_multi_now_ms()) > 0) {
        ch32_i2c_multi_can_frame_t frame;
        ch32_i2c_multi_result_t poll_result =
            ch32_i2c_multi_session_poll(node, &frame, deadline);
        if (poll_result != CH32_I2C_MULTI_RESULT_OK) {
            if (poll_result == CH32_I2C_MULTI_RESULT_OVERFLOW) {
                ch32_i2c_multi_session_release(node);
                return poll_result;
            }
            continue;
        }
        if (frame.id == CAN_ID_STATUS_BASE + node->node_id && frame.dlc == 8U &&
            frame.data[0] == I2C_STATUS_READ_CHUNK && frame.data[1] == request_id &&
            frame.data[3] <= 4U && (uint16_t)frame.data[2] + frame.data[3] <= read_len) {
            memcpy(&read_data[frame.data[2]], &frame.data[4], frame.data[3]);
            if ((uint8_t)(frame.data[2] + frame.data[3]) > received) received = (uint8_t)(frame.data[2] + frame.data[3]);
        } else if (frame.id == CAN_ID_STATUS_BASE + node->node_id && frame.dlc == 8U &&
                   frame.data[0] == I2C_STATUS_READ_DONE && frame.data[1] == request_id &&
                   frame.data[2] == addr && frame.data[4] == read_len) {
            done_received = true; done_success = frame.data[5] != 0U && frame.data[6] == read_len;
        } else if (frame.id == CAN_ID_ACK_BASE + node->node_id && frame.dlc == 8U &&
                   frame.data[0] == I2C_CMD_WRITE_READ && frame.data[2] == node->node_id &&
                   frame.data[3] == I2C_DEVICE_TYPE) {
            ack_received = true; ack_success = frame.data[1] != 0U;
        }
        if (done_received && ack_received) {
            result = done_success && ack_success && received == read_len ?
                     CH32_I2C_MULTI_RESULT_OK : CH32_I2C_MULTI_RESULT_COMM_FAIL;
            ch32_i2c_multi_session_release(node); return result;
        }
    }
    ch32_i2c_multi_session_release(node);
    return CH32_I2C_MULTI_RESULT_TIMEOUT;
}

ch32_i2c_multi_result_t ch32_i2c_multi_write_read_to(
    const ch32_i2c_multi_node_t *node, uint8_t addr,
    const uint8_t *write_data, uint8_t write_len,
    uint8_t *read_data, uint8_t read_len)
{
    return ch32_i2c_multi_write_read_to_timeout(
        node, addr, write_data, write_len, read_data, read_len,
        s_cfg.command_timeout_ms);
}

static ch32_i2c_multi_result_t ch32_i2c_multi_set_speed(
    ch32_i2c_multi_node_t *node, uint8_t speed_code)
{
    uint8_t command[8] = {I2C_CMD_SET_SPEED, speed_code, 0U, 0U,
                           0U, 0U, 0U, 0U};
    ch32_i2c_multi_result_t result;

    if (!ch32_i2c_multi_node_valid(node)) {
        return CH32_I2C_MULTI_RESULT_INVALID_ARG;
    }
    if (node->speed_valid && node->active_speed_code == speed_code) {
        return CH32_I2C_MULTI_RESULT_OK;
    }
    result = ch32_i2c_multi_run_command_timeout(
        node, command, I2C_STATUS_SPEED, 0U, speed_code, NULL,
        s_cfg.command_timeout_ms);
    if (result == CH32_I2C_MULTI_RESULT_OK) {
        node->active_speed_code = speed_code;
        node->speed_valid = true;
    }
    return result;
}

ch32_i2c_multi_result_t ch32_i2c_multi_set_speed_100k(
    ch32_i2c_multi_node_t *node)
{
    return ch32_i2c_multi_set_speed(node, 0U);
}

ch32_i2c_multi_result_t ch32_i2c_multi_set_speed_400k(
    ch32_i2c_multi_node_t *node)
{
    return ch32_i2c_multi_set_speed(node, 1U);
}

uint32_t ch32_i2c_multi_get_status(ch32_i2c_multi_status_field_t field)
{
    return ch32_can_gateway_core_get_status(
        (ch32_can_gateway_status_field_t)field);
}

const char *ch32_i2c_multi_result_text(ch32_i2c_multi_result_t result)
{
    switch (result) {
    case CH32_I2C_MULTI_RESULT_OK:
        return "OK";
    case CH32_I2C_MULTI_RESULT_TIMEOUT:
        return "TIMEOUT";
    case CH32_I2C_MULTI_RESULT_COMM_FAIL:
        return "COMM_FAIL";
    case CH32_I2C_MULTI_RESULT_NO_DATA:
        return "NO_DATA";
    case CH32_I2C_MULTI_RESULT_NODE_NOT_FOUND:
        return "NODE_NOT_FOUND";
    case CH32_I2C_MULTI_RESULT_INVALID_ARG:
        return "INVALID_ARG";
    case CH32_I2C_MULTI_RESULT_BUSY:
        return "BUSY";
    case CH32_I2C_MULTI_RESULT_OVERFLOW:
        return "OVERFLOW";
    default:
        return "UNKNOWN";
    }
}

const char *ch32_i2c_multi_role_text(ch32_i2c_multi_role_t role)
{
    return role == CH32_I2C_MULTI_ROLE_MASTER ? "MASTER" : "SLAVE";
}
